-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 13 2024 г., 17:05
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `tenge`
--

-- --------------------------------------------------------

--
-- Структура таблицы `deposit`
--

CREATE TABLE `deposit` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `balance` int(11) DEFAULT NULL,
  `last` varchar(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `deposit`
--

INSERT INTO `deposit` (`id`, `uid`, `name`, `balance`, `last`) VALUES
(6, 1, 'Каспи Банк', 456197691, NULL),
(7, 1, 'Главный Депозит', 2501200, NULL),
(10, 2, 'Каспи Банк', 456197691, NULL),
(11, 2, 'Главный Депозит', 2501200, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `history`
--

CREATE TABLE `history` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `did` int(11) NOT NULL,
  `type` varchar(50) NOT NULL,
  `summa` int(20) NOT NULL,
  `comment` varchar(255) DEFAULT NULL,
  `time` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `history`
--

INSERT INTO `history` (`id`, `uid`, `did`, `type`, `summa`, `comment`, `time`) VALUES
(169, 1, 2, 'minus', 1500, 'Без комментарий', '2024-03-10 11:18'),
(170, 1, 2, 'minus', 3500, 'Возврат суммы', '2024-03-10 11:22'),
(171, 1, 2, 'plus', 10000, 'Восстановление депозита  ', '2024-03-10 11:23'),
(172, 1, 2, 'plus', 2500, 'Без комментарий', '2024-03-10 12:10'),
(173, 1, 3, 'minus', 15000, 'Для теста', '2024-03-10 12:42'),
(174, 1, 2, 'plus', 45000, 'Без комментарий', '2024-03-10 13:13'),
(175, 1, 2, 'minus', 15000, 'Без комментарий', '2024-03-10 13:15'),
(176, 1, 3, 'plus', 851000, 'Без комментарий', '2024-03-10 14:00'),
(177, 1, 3, 'minus', 850000, 'Без комментарий', '2024-03-10 14:01'),
(178, 1, 2, 'plus', 45000, 'Без комментарий', '2024-03-10 14:38'),
(179, 1, 3, 'minus', 1000, 'Без комментарий', '2024-03-10 14:46'),
(180, 1, 4, 'plus', 12500000, 'Без комментарий', '2024-03-10 14:47'),
(181, 1, 4, 'minus', 10000000, 'Без комментарий', '2024-03-10 14:48'),
(182, 1, 2, 'plus', 9000000, 'Без комментарий', '2024-03-10 14:48'),
(183, 1, 2, 'minus', 5000, 'вАНЕССЕ', '2024-03-11 12:46'),
(184, 1, 2, 'minus', 2000000, 'Тест', '2024-03-11 12:51'),
(185, 1, 2, 'plus', 20000000, 'Без комментарий', '2024-03-11 12:51'),
(186, 1, 2, 'minus', 40000000, 'Без комментарий', '2024-03-11 12:52'),
(187, 1, 2, 'minus', 4000000, 'Без комментарий', '2024-03-11 12:52'),
(188, 1, 2, 'plus', 8000000, 'Без комментарий', '2024-03-11 12:53'),
(189, 1, 2, 'plus', 100000000, 'пропрорпо', '2024-03-11 12:53'),
(190, 1, 2, 'minus', 677979809, 'Без комментарий', '2024-03-11 12:53'),
(191, 1, 2, 'plus', 700000, 'Без комментарий', '2024-03-11 12:53'),
(192, 1, 2, 'minus', 200000000, 'Без комментарий', '2024-03-11 12:53'),
(193, 1, 2, 'plus', 12300000, 'Без комментарий', '2024-03-11 12:54'),
(194, 1, 2, 'plus', 1230000000, 'Без комментарий', '2024-03-11 12:54'),
(195, 1, 2, 'plus', 50000, 'Без комментарий', '2024-03-13 08:33'),
(196, 1, 5, 'plus', 150000, 'Без комментарий', '2024-03-13 08:48'),
(225, 2, 2, 'minus', 1500, 'Без комментарий', '2024-03-10 11:18'),
(226, 2, 2, 'minus', 3500, 'Возврат суммы', '2024-03-10 11:22'),
(227, 2, 2, 'plus', 10000, 'Восстановление депозита  ', '2024-03-10 11:23'),
(228, 2, 2, 'plus', 2500, 'Без комментарий', '2024-03-10 12:10'),
(229, 2, 3, 'minus', 15000, 'Для теста', '2024-03-10 12:42'),
(230, 2, 2, 'plus', 45000, 'Без комментарий', '2024-03-10 13:13'),
(231, 2, 2, 'minus', 15000, 'Без комментарий', '2024-03-10 13:15'),
(232, 2, 3, 'plus', 851000, 'Без комментарий', '2024-03-10 14:00'),
(233, 2, 3, 'minus', 850000, 'Без комментарий', '2024-03-10 14:01'),
(234, 2, 2, 'plus', 45000, 'Без комментарий', '2024-03-10 14:38'),
(235, 2, 3, 'minus', 1000, 'Без комментарий', '2024-03-10 14:46'),
(236, 2, 4, 'plus', 12500000, 'Без комментарий', '2024-03-10 14:47'),
(237, 2, 4, 'minus', 10000000, 'Без комментарий', '2024-03-10 14:48'),
(238, 2, 2, 'plus', 9000000, 'Без комментарий', '2024-03-10 14:48'),
(239, 2, 2, 'minus', 5000, 'вАНЕССЕ', '2024-03-11 12:46'),
(240, 2, 2, 'minus', 2000000, 'Тест', '2024-03-11 12:51'),
(241, 2, 2, 'plus', 20000000, 'Без комментарий', '2024-03-11 12:51'),
(242, 2, 2, 'minus', 40000000, 'Без комментарий', '2024-03-11 12:52'),
(243, 2, 2, 'minus', 4000000, 'Без комментарий', '2024-03-11 12:52'),
(244, 2, 2, 'plus', 8000000, 'Без комментарий', '2024-03-11 12:53'),
(245, 2, 2, 'plus', 100000000, 'пропрорпо', '2024-03-11 12:53'),
(246, 2, 2, 'minus', 677979809, 'Без комментарий', '2024-03-11 12:53'),
(247, 2, 2, 'plus', 700000, 'Без комментарий', '2024-03-11 12:53'),
(248, 2, 2, 'minus', 200000000, 'Без комментарий', '2024-03-11 12:53'),
(249, 2, 2, 'plus', 12300000, 'Без комментарий', '2024-03-11 12:54'),
(250, 2, 2, 'plus', 1230000000, 'Без комментарий', '2024-03-11 12:54'),
(251, 2, 2, 'plus', 50000, 'Без комментарий', '2024-03-13 08:33'),
(252, 2, 5, 'plus', 150000, 'Без комментарий', '2024-03-13 08:48');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `create` varchar(50) DEFAULT NULL,
  `last` varchar(50) DEFAULT NULL,
  `addres` varchar(255) DEFAULT NULL,
  `city` varchar(50) DEFAULT NULL,
  `country` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `phone`, `create`, `last`, `addres`, `city`, `country`) VALUES
(1, 'Арман Бексултанович', 'lopglopl@gmail.com', '21232f297a57a5a743894a0e4a801fc3', '77066069181', '2024-02-15', '2024-03-13 07:56', 'Бекдаира 46', 'Алматы', 'kz'),
(2, 'Нурадиль', 'adil19032004@gmail.com', '21232f297a57a5a743894a0e4a801fc3', NULL, NULL, NULL, NULL, NULL, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `deposit`
--
ALTER TABLE `deposit`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `history`
--
ALTER TABLE `history`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `deposit`
--
ALTER TABLE `deposit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `history`
--
ALTER TABLE `history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=253;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
